<?php
/**
 * Created by PhpStorm.
 * User: user
 * Date: 15.10.2018
 * Time: 17:47
 */
error_reporting(E_ALL);
//1------------------------------------

$name = 'Piter';

//2------------------------------------

$age = 28;

//3-------------------------------------

echo "Меня зовут: $name.".PHP_EOL;

//4-------------------------------------

echo "Мне $age лет.".PHP_EOL;

//5-------------------------------------

echo "</br>Меня зовут: $name.</br>".PHP_EOL;
echo "Мне $age лет.</br>".PHP_EOL;

//6-------------------------------------
$age=23;
if($age==21){
    echo "Мне $age год.</br>".PHP_EOL;
}elseif ($age==23){
    echo "Мне $age года.</br>".PHP_EOL;
}elseif($age==28){
    echo "Мне $age лет.</br>".PHP_EOL;
}

//7-------------------------------------

/** Сдесь я удалил переменую $age, потому что не знаю зачем это делать и как потом отсылать?
 * Лучше я просто заменю переменую $age на $AGE*/

//8-------------------------------------

echo "Мне $AGE лет.".PHP_EOL;