<?php
/**
 * Created by PhpStorm.
 * User: user
 * Date: 15.10.2018
 * Time: 17:47
 */

header('Content-Type: text/html; charset=utf-8');
error_reporting(E_ALL);
//1------------------------------------

$name = 'Piter';

//2------------------------------------

//$age = 28;

//3-------------------------------------

echo "Меня зовут: $name.".'</br>';

//4-------------------------------------

echo "Мне $age лет.".'</br>';

//5-------------------------------------

echo "</br>Меня зовут: $name.</br>";
echo "Мне $age лет.</br>".'</br>';

//6-------------------------------------
$age=28;
if ($age < 0 || $age >= 113) {
    echo 'Вы должны ввести в диапозоне от 0 до 112.'.'</br>';
} else if (($age / 10) % 10 == 1 || $age % 10 == 0) {
    echo'Вам :'.$age.'лет.'.'</br>';
} else if ($age % 10 == 1) {
    echo 'Ваш возраст'.$age.'год.'.'</br>';
} else if ($age % 10 == 2 || $age % 10 == 3 || $age % 10 == 4) {
    echo 'Ваш возраст'.$age.'годa.'.'</br>';
} else {
    echo'Вам :'.$age.'лет.'.'</br>';
}

//7-------------------------------------

// Здесь я удалил переменую $age

//8-------------------------------------

echo "Мне $age лет.".PHP_EOL;